# 画像結合  comb.py
import cv2
import glob
import numpy as np
from PIL import Image
from natsort import natsorted

# 所定のフォルダ内にある jpg ファイルを連続で読み込んでリスト化する
#for s in [5,6,7,8,9,10,11,12,13,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,123,124,125,126,127,128,129,130,131,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,159,160,161,162,163,164,201,202,203,205,206,207,208,209,210,211,212,213,214,215,216,217,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,259,260,261,262,263,264,265,267,268,269,270,271,272,282,283,284,285,286,287,288,289,290,291,292,293,294,295,296,297,298,299,300,301,302,303,304,305,306,307,308,309,310,311,312,313,314,315,316,317,318,319,320,321,322,323,324,325,326,327,328,329,330,331,333,334,335,336,337,338,339,340,341,342,343,344,345,346,347,348,349,350,351,352,353,354,355,356,357,358]:

s=5
files = glob.glob(f"{s}/*.jpg")
print(files)
# 空のリストを準備
d = []

# natsortedで自然順（ファイル番号の小さい順）に1個づつ読み込む
for i in natsorted(files):
    img = Image.open(i)    # img は'JpegImageFile' object
    img = np.asarray(img)  # np.asarrayで img を ndarray に変換
    d.append(img)          # d にappend で img を追加

# 画像の高さ方向と幅方向を結合
img_x = np.vstack((np.hstack(d[0:4]),
                np.hstack(d[4:8]),
                np.hstack(d[8:12]),
                np.hstack(d[12:16])
                ))

# 色をBGR から RGB に変更
img_x = cv2.cvtColor(img_x, cv2.COLOR_BGR2RGB)
cv2.imshow('img_after', img_x)
cv2.imwrite(f'.result{s}.png', img_x)
print('aaaaaa')

cv2.waitKey(0)
cv2.destroyAllWindows()